# Data Acquisition

In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
from pydataset import data

## 1.

Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [2]:
df_iris = data('iris')

- print the first 3 rows

In [3]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

- print the number of rows and columns (shape)

In [4]:
df_iris.shape

(150, 5)

- print the column names

In [5]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

- print the data type of each column

In [6]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

- print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [7]:
df_iris.describe().T

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

**Based on summary statistics, rescaling does not seem to be necessary for this data set, values seem similar in units and magnitude**

## 2.

Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

In [8]:
df_excel = pd.read_excel("~/codeup-data-science/data/Spreadsheets_Exercises.xlsx")

In [9]:
df_excel.drop(columns = ['Unnamed: 12', 'Unnamed: 13'], inplace = True)

- assign the first 100 rows to a new dataframe, df_excel_sample

In [10]:
# df_excel_sample = df_excel.head(100) # This would create a copy that points to same df in memory and both sample and original would be edited when making changes to sample

In [11]:
# better way to do this since dfs are mutable and we don't want to be alterating the original df when we alter the sample

df_excel_sample = df_excel.head(100).copy()

- print the number of rows of your original dataframe

In [12]:
df_excel.shape[0]

7049

- print the first 5 column names

In [13]:
df_excel.columns[0:5].tolist()

['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents']

- print the column names that have a data type of object

In [14]:
df_excel.select_dtypes(include=["object"]).columns.tolist()

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn']

- compute the range for each of the numeric variables.

In [15]:
# numeric types in this df are float64 data type, int64 columns are categorical or boolean columns
df_excel.select_dtypes(include=['float64']).columns

Index(['monthly_charges', 'total_charges'], dtype='object')

In [16]:
# range for monthly charges column
df_excel.monthly_charges.max() - df_excel.monthly_charges.min()

100.5

In [17]:
# range for total charges column
df_excel.total_charges.max() - df_excel.total_charges.min()

8666.0

## 3.

Read the data from this google sheet (https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357) into a dataframe, df_google

In [18]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

- print the first 3 rows

In [19]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

- print the number of rows and columns

In [20]:
df_google.shape

(891, 12)

- print the column names

In [21]:
df_google.columns.tolist()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

- print the data type of each column

In [22]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

- print the summary statistics for each of the numeric variables

In [23]:
df_google.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

- print the unique values for each of your categorical variables

**Row indices will be unique values for each categorical column below**

In [24]:
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [25]:
df_google.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [26]:
df_google.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [27]:
df_google.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [28]:
df_google.SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [29]:
df_google.Parch.value_counts()

0    678
1    118
2     80
3      5
5      5
4      4
6      1
Name: Parch, dtype: int64

In [30]:
df_google.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [31]:
# seems like there should be a better way to do this one

In [32]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [33]:
# could also do similar thing with .unique()

In [34]:
df_google.Survived.unique()

array([0, 1])

In [35]:
df_google.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [36]:
# do this using a for loop looking for objects and ints since those are categorical in this df
for column in df_google.select_dtypes(include=['object', 'int64']).columns:
    print(f"Values in the {column} column:")
    print(df_google[column].value_counts())
    print("------")
    print()

Values in the PassengerId column:
1      1
599    1
588    1
589    1
590    1
      ..
301    1
302    1
303    1
304    1
891    1
Name: PassengerId, Length: 891, dtype: int64
------

Values in the Survived column:
0    549
1    342
Name: Survived, dtype: int64
------

Values in the Pclass column:
3    491
1    216
2    184
Name: Pclass, dtype: int64
------

Values in the Name column:
Skoog, Mrs. William (Anna Bernhardina Karlsson)    1
Tobin, Mr. Roger                                   1
Chaffee, Mr. Herbert Fuller                        1
Perreault, Miss. Anne                              1
Sage, Miss. Constance Gladys                       1
                                                  ..
Christy, Miss. Julie Rachel                        1
Johansson, Mr. Erik                                1
Maisner, Mr. Simon                                 1
Stead, Mr. William Thomas                          1
Harper, Miss. Annie Jessie "Nina"                  1
Name: Name, Length: 891, dtype: int64
------

Values in the Sex column:
male      577
female    314
Name: Sex, dtype: int64
------

Values in the SibSp column:
0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64
------

Values in the Parch column:
0    678
1    118
2     80
3      5
5      5
4      4
6      1
Name: Parch, dtype: int64
------

Values in the Ticket column:
CA. 2343    7
347082      7
1601        7
CA 2144     6
3101295     6
           ..
349912      1
2664        1
349208      1
330909      1
349251      1
Name: Ticket, Length: 681, dtype: int64
------

Values in the Cabin column:
B96 B98            4
C23 C25 C27        4
G6                 4
D                  3
F2                 3
F33                3
C22 C26            3
E101               3
C93                2
C125               2
D33                2
B51 B53 B55        2
E8                 2
C78                2
B58 B60            2
E25                2
B20                2
C68                2
D17                2
C83                2
C92                2
B22                2
D35                2
C2                 2
F G73              2
C65                2
F4                 2
D20                2
B18                2
C52                2
B57 B59 B63 B66    2
C124               2
B5                 2
B28                2
E33                2
E67                2
D36                2
D26                2
C126               2
B49                2
E44                2
B35                2
E121               2
B77                2
E24                2
C123               2
B82 B84            1
C50                1
T                  1
C30                1
E58                1
C90                1
C99                1
A23                1
E46                1
D45                1
B101               1
C62 C64            1
B69                1
C118               1
B73                1
C86                1
A32                1
D30                1
B3                 1
A24                1
C103               1
E17                1
C87                1
B38                1
E10                1
C128               1
C49                1
D21                1
D50                1
E49                1
C45                1
E77                1
B78                1
E12                1
E38                1
E36                1
D6                 1
C7                 1
D19                1
C85                1
A16                1
C104               1
D46                1
D49                1
A10                1
C82                1
E34                1
D56                1
B86                1
E31                1
C91                1
F E69              1
B79                1
C32                1
A19                1
C106               1
A6                 1
D37                1
B80                1
F38                1
C148               1
D28                1
E63                1
C110               1
B71                1
E50                1
B19                1
A7                 1
C54                1
D9                 1
C101               1
D11                1
C95                1
A5                 1
C111               1
C46                1
A20                1
E40                1
D7                 1
A34                1
A31                1
B94                1
B50                1
A14                1
A36                1
E68                1
B41                1
D47                1
C70                1
C47                1
B39                1
F G63              1
B102               1
B30                1
D15                1
B4                 1
B37                1
A26                1
D10 D12            1
B42                1
D48                1
Name: Cabin, dtype: int64
------

Values in the Embarked column:
S    644
C    168
Q     77
Name: Embarked, dtype: int64
------

In [37]:
# validation that code for acquire.py is working properly

# from env import host, user, password

In [38]:
# url = f'mysql+pymysql://{user}:{password}@{host}/titanic_db'
# query = '''
# select * from passengers;
# '''
# df = pd.read_sql(query, url)
# df.head()

In [39]:
# def get_titanic_data():
#     from env import host, user, password # not sure if I should do this inside the function or outside
#     url = f'mysql+pymysql://{user}:{password}@{host}/titanic_db'
#     query = '''
#     select * from passengers;
#     '''
#     df = pd.read_sql(query, url)
#     return df

In [40]:
# get_titanic_data() # seems to be working as intended

In [41]:
# def get_iris_data():
#     from env import host, user, password # not sure if I should do this inside the function or outside
#     url = f'mysql+pymysql://{user}:{password}@{host}/iris_db'
#     query = '''
#     select * from measurements
#     join species using(species_id);
#     '''
#     df = pd.read_sql(query, url)
#     return df

In [42]:
# get_iris_data()

In [43]:
# import os

# def get_titanic_data():
#     filename = "titanic.csv"

#     if os.path.isfile(filename):
#         return pd.read_csv(filename)
#     else:
#         # read the SQL query into a dataframe
#         from env import host, user, password
#         url = f'mysql+pymysql://{user}:{password}@{host}/titanic_db'
#         query = '''
#         select * from passengers;
#         '''
#         df = pd.read_sql(query, url)

#         # Write that dataframe to disk for later. Called "caching" the data for later.
#         df.to_csv(filename)

#         # Return the dataframe to the calling code
#         return df

In [44]:
# get_titanic_data()

In [45]:
# def get_iris_data():
#     filename = "iris.csv"

#     if os.path.isfile(filename):
#         return pd.read_csv(filename)
#     else:
#         # read the SQL query into a dataframe
#         from env import host, user, password # not sure if I should do this inside the function or outside
#         url = f'mysql+pymysql://{user}:{password}@{host}/iris_db'
#         query = '''
#         select * from measurements
#         join species using(species_id);
#         '''
#         df = pd.read_sql(query, url)

#         # Write that dataframe to disk for later. Called "caching" the data for later.
#         df.to_csv(filename)

#         # Return the dataframe to the calling code
#         return df

In [46]:
# get_iris_data()

# Data Preparation

In [47]:
from acquire import get_iris_data

The end product of this exercise should be the specified functions in a python script named prepare.py. Do these in your classification_exercises.ipynb first, then transfer to the prepare.py file.

Using the Iris Data:

## 1.

- Use the function defined in acquire.py to load the iris data.

In [48]:
iris = get_iris_data()
iris.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

## 2.

- Drop the species_id and measurement_id columns.

In [49]:
iris.drop(columns = ['species_id'], inplace = True)
iris.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

## 3.

- Rename the species_name column to just species.

In [50]:
iris = iris.rename(columns = {'species_name' : 'species'})
iris.head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

## 4.

- Create dummy variables of the species name.

In [51]:
# use pd.get_dummies. Returns a dataframe

iris_dummy = pd.get_dummies(iris['species'], drop_first=False)

iris_dummy.head()

   setosa  versicolor  virginica
0       1           0          0
1       1           0          0
2       1           0          0
3       1           0          0
4       1           0          0

In [52]:
# append dummy df cols to the original df. 

iris = pd.concat([iris, iris_dummy], axis = 1)

iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,setosa,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0

## 5.

- Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [53]:
def prep_iris(df): # I will pass the unprepped df into the function
    df.drop(columns = ['species_id'], inplace = True)
    df = df.rename(columns = {'species_name' : 'species'})
    df_dummy = pd.get_dummies(df['species'], drop_first=False)
    df = pd.concat([df, df_dummy], axis = 1)
    return df

In [54]:
iris = get_iris_data()
iris.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

In [55]:
df = prep_iris(iris)

In [56]:
df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,setosa,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0